Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/court_procedures.html.txt.tmx
Source language: en
Languages: ga

source: Court proceedings for recovering debts
ga: Imeachtaí cúirte chun fiachais a aisghabháil

source: Most court proceedings in relation to debt are civil proceedings
ga: Tá an chuid is mó d’imeachtaí cúirte maidir le fiachas ina n-imeachtaí sibhialta

source: You may be eligible for civil legal aid if you pass the means test and if your case is likely to succeed
ga: D'fhéadfá a bheith incháilithe do chúnamh dlí sibhialta dá n-éireodh leat sa tástáil acmhainne agus dá mbeadh gach cosúlacht ann go n-éireodh le do chás

source: If you accept that you owe the debt and that you have no defence to the claim, then your case is unlikely to succeed and you would not get civil legal aid
ga: Má ghlacann tú go bhfuil an fiachas ort agus nach bhfuil aon chosaint agat in aghaidh an éilimh, ní dócha go n-éireodh le do chás agus ní gheobhaidh tú cúnamh dlí sibhialta

source: If a judgment order is made against you, you are usually liable for the costs incurred by your creditor in taking the case
ga: Más rud é go ndéanfar ordú breithiúnais i do choinne, beidh tú faoi dhliteanas na gcostas arna dtabhú ag do chreidiúnaí i dtógáil an cháis

source: These costs are added to the amount of the judgment and can be enforced against you as part of the enforcement of the judgment
ga: Tá na costais seo curtha le méid an bhreithiúnais agus is féidir iad a chur i bhfeidhm i do choinne mar chuid de fhorghníomhú an bhreithiúnais

source: If you fail to pay an instalment order and you are summonsed to court for committal proceedings, you are eligible for criminal legal aid
ga: Má theipeann ort ordú tráthchoda a íoc agus má ghairtear ort teacht chun na cúirte le haghaidh imeachtaí cimithe, tá tú i dteideal cúnamh dlí coiriúil

source: The decision on whether or not you get such aid is made by the judge dealing with the committal proceedings
ga: Is é an breitheamh atá ag déileáil leis na himeachtaí cimithe a dhéanann an cinneadh maidir le cibé acu an bhfaigheann tú an cúnamh nó nach bhfaigheann

source: Court procedures for judgment
ga: Nósanna imeachta na gCúirteanna i leith breithiúnas a fháil

source: If you fail to pay a debt, your creditor is likely to go to court in order to get a court judgment that you owe the debt and then enforce that judgment
ga: Má theipeann ort fiachas a íoc, is dócha go dtéann do chreidiúnaí chun na cúirte chun breithiúnas cúirte a fháil go bhfuil fiachas ort, agus an breithiúnas sin a chur i bhfeidhm ansin

source: • If you owe less than €15,000, the court proceedings must be brought in the District Court; proceedings are started when the creditor issues you with a claim notice; the procedure is governed by the District Court Rules
ga: • Má tá níos lú ná €15,000 ort, caithfidh na himeachtaí cúirte a thionól sa Chúirt Dúiche; cuirfear tús le himeachtaí nuair a eiseoidh an creidiúnaí Toghairm Shibhialta duit; tá an nós imeachta seo faoi réir Rialacha Cúirte Dúiche

source: • If you owe between €15,000 and €75,000, the court proceedings must be brought in the Circuit Court; proceedings are started when the creditor serves you with an Ordinary Civil Bill; the procedure is governed by the Rules of the Circuit Court
ga: • Má tá idir €15,000 agus €75,000 ort, ní mór na himeachtaí cúirte a thionól sa Chúirt Chuarda; cuirfear tús le himeachtaí nuair a dhéanfaidh an creidiúnaí Gnáthbhille Sibhialta a sheirbheáil ort; tá an nós imeachta seo faoi réir Rialacha na Cúirte Cuarda

source: • If you owe more than €75,000, the court proceedings must be brought in the High Court; proceedings are started when you are served with a Summary Summons by the creditor; the procedure is governed by the Rules of the Superior Courts
ga: • Má tá níos mó ná €75,000 ort, ní mór na himeachtaí cúirte a thionól san Ardchúirt; cuirfear tús le himeachtaí nuair a dhéanfaidh an creidiúnaí Toghairm Achomair a sheirbheáil ort; tá an nós imeachta seo faoi réir Rialacha na hUaschúirte

source: The procedures and the documents which are used are different depending on which court is involved and sometimes on which kind of debt is involved
ga: Bíonn na nósanna imeachta agus na cáipéisí a úsáidtear éagsúil ag brath ar an gcúirt atá i gceist agus ar an gcineál fiachais atá i gceist uaireanta

source: The proceedings are started by the person to whom you owe money
ga: Cuireann an duine a bhfuil an t-airgead aige/aici ort tús leis na himeachtaí

source: That person (or group of people or company) is the creditor and the claimant or plaintiff in the case
ga: Is é an duine sin (nó grúpa daoine nó cuideachta) an creidiúnaí agus an gearánaí sa chás

source: You are the debtor and the respondent or defendant in the case
ga: Is tusa an féichiúnaí agus an cosantóir sa chás

source: In general, you are served with documents that set out the details of what you owe
ga: De ghnáth, seirbheálfar cáipéisí ort a leagann amach sonraí an mhéid atá ort

source: You then have an opportunity to defend the action – this means that you must issue a replying document arguing that you do not owe the money, or that the contract is not valid, or whatever legal defence is open to you
ga: Tá an deis agat an chaingean a chosaint ansin - ciallaíonn sé seo nach mór duit cáipéis freagartha a eisiúint ag argóint nach bhfuil an t-airgead ort nó nach bhfuil an conradh bailí nó cibé cosaint dhlíthiúil atá ar fáil duit

source: If you do not do anything, then there is little doubt that judgment will be awarded against you
ga: Mura ndéanann tú aon rud, níl aon amhras ann go ndéanfar an breithiúnas i d’aghaidh

source: In general, if you are served with a document starting legal proceedings, you have 3 options:
ga: De ghnáth, má sheirbheálfar an cháipéis ort a chuireann tús le himeachtaí cúirte, tá trí rogha agat:

source: • You usually have a number of days in which to pay the debt and the proceedings then do not start
ga: • Tá roinnt laethanta agat chun an fiachas a íoc, agus ansin ní thosóidh na himeachtaí

source: The legal term is that the proceedings are stayed
ga: Is é an téarma dlí go bhfuil na himeachtaí 'bactha'

source: • If you cannot pay what is owed and you have no defence, you may consent to an order being made
ga: • Mura féidir leat an méid atá ort a íoc agus níl aon chosaint agat, is féidir leat an t-ordú a thoiliú

source: • If you intend to defend the action, you must serve the necessary replying documents
ga: • Má tá sé ar intinn agat an chaingean a chosaint, ní mór duit na cáipéisí riachtanacha freagartha a sheirbheáil

source: Then a date is usually set for a hearing and the matter is decided at the hearing
ga: De ghnáth, socrófar dáta le haghaidh éisteachta ansin agus déanfar cinneadh ar an gceist ag an éisteacht

source: If the matter in issue is covered by consumer credit legislation, then the person to whom you owe the money (the creditor) must issue a notice to you at least 10 days before taking legal action
ga: Má chlúdaítear an t-ábhar i gceist faoi reachtaíocht chreidmheasa tomhaltóra, ní mór don duine a bhfuil an t-airgead aige/aici ort ('an creidiúnaí') fógra a eisiúint duit deich lá ar a laghad roimh an gcaingean dlí a thógáil

source: This notice must outline:
ga: Caithfidh an fógra seo breac-chuntas a thabhairt ar:

source: • The name and address of the creditor or owner
ga: • Ainm agus seoladh an chreidiúnaí nó an úinéara;

source: • Your name and address
ga: • D'ainm agus do sheoladh;

source: • The term of the agreement to be enforced and
ga: • Théarma an chomhaontaithe le cur i bhfeidhm, agus

source: • A statement of the action the creditor intends to take to enforce the agreement, the manner and circumstances in which he/she intends to take this action and the date on or after which such action will be taken
ga: • Ráiteas ar an mbeart a dhéanfaidh an creidiúnaí chun an comhaontú a fhorfheidhmiú, an bealach agus na himthosca ina mbeidh an chaingean seo á tógáil agus an dáta ar a dtógfaidh caingean den sórt sin

source: If the consumer credit legislation does not apply, then it is the usual practice for creditors to send a seven-day demand letter to you before starting legal proceedings
ga: Más rud é nach bhfuil reachtaíocht chreidmheasa tomhaltóra i gceist, de ghnáth, seolfaidh do chreidiúnaithe litir éilimh chugat seacht lá roimh thús na himeachtaí dlíthiúla

source: This, however, is not a legal requirement
ga: Ní riachtanas dlí é seo, áfach

source: You, as the debtor, are generally liable for the costs of the court action
ga: Is tusa, mar an bhféichiúnaí, a bheidh faoi dhliteanas chostais na caingne cúirte de ghnáth

source: The procedural rules are set out in the District Court Rules
ga: Tá na rialacha a bhaineann le nósanna imeachta leagtha amach i Rialacha na Cúirte Dúiche

source: In general, the legal proceedings must be started in the District Court area in which you live or in which the contract was made
ga: De ghnáth, caithfear na himeachtaí dlíthiúla a thosú i gceantar na Cúirte Dúiche ina bhfuil tú i do chónaí nó ina ndearnadh an conradh

source: However, if the contract comes within the Consumer Credit Act 1995, the proceedings may be brought only in the District Court area in which you live
ga: Mar sin féin, má thagann an conradh faoin Acht um Chreidmheas do Thomhaltóirí 1995, ní féidir na himeachtaí a thionól ach amháin i gceantar na Cúirte Dúiche ina bhfuil tú i do chónaí

source: District Court proceedings are started when the creditor issues a claim notice to you
ga: Cuirtear tús le himeachtaí na Cúirte Dúiche nuair a eisíonn an creidiúnaí Toghairm Shibhialta duit

source: This notice states the creditor’s claim, for example, that you owe him €5,000 for goods bought on a specific date
ga: Leagann an toghairm dáta amach ar a mbeidh na himeachtaí ag tosú – tugtar 'dáta fillte' air seo

source: The notice gives you 2 options:
ga: Tugann an toghairm trí rogha duit:

source: • If you pay the amount claimed within 10 days of the service of the claim notice, you will not have to go to court
ga: • Má íocann tú an méid éilithe laistigh de 10 lá ó lá ar ar seirbheáladh an toghairm, ní thosóidh na himeachtaí;

source: • If you intend to dispute the claim, you must notify the claimant of your intention to do so within 28 days of receiving the notice; you use an appearance and defence form to do this
ga: • Má tá sé ar intinn agat agóid i gcoinne an éilimh, ní mór duit do rogha a chur in iúl don chúirt laistigh de 7 lá tar éis an toghairm a fháil; ba chóir duit an 'Fógra go bhfuiltear chun Cosaint a dhéanamh' a úsáid, atá iniata leis an toghairm; más rud é nach ndéanann tú é seo, ní féidir leat dul go dtí an chúirt agus iarracht a dhéanamh cosaint a chur isteach

source: The claim notice may be served on you in person at your home or by registered post. If it is not possible to serve the notice in one of these ways, the creditor may ask the District Court to allow substituted service – this means that it may be served in some other way, for example, by ordinary post
ga: • Má ghlacann tú go bhfuil an t-airgead ort ach ba mhaith leat níos mó ama a fháil chun é a íoc, léiríonn an toghairm cad is gá duit a dhéanamh; ní mór duit dul go dtí aturnae an chreidiúnaí laistigh de 10 lá, agus foirm toilithe a shíniú

source: If this does not succeed, for example, because the creditor does not know your current address, the creditor may ask the court to deem the notice to have been properly served
ga: I gcásanna áirithe, is féidir leat toiliú a thabhairt chun an fiachas a íoc trí thráthchodanna

source: The creditor must then provide proof of service either by oral evidence to the court or by a statutory declaration of service
ga: Caithfear an toghairm shibhialta a sheirbheáil ort ar a laghad 21 lá roimh an dáta fillte

source: Any such documents must be lodged with the District Court clerk at least 4 days before the court hearing
ga: Féadfar é a sheirbheáil go pearsanta ag do theach nó tríd an bpost cláraithe

source: If you do not indicate your intention to defend the proceedings, there is no hearing and the creditor gets a judgment that you owe the money
ga: Caithfidh an creidiúnaí cruthúnas seirbhíse a sholáthar ansin cé acu an bhfuil sé sin trí fhianaise béil don chúirt nó trí dhearbhú reachtúil seirbhíse

source: The creditor files with the District Court Clerk:
ga: Ní mór aon cháipéis den sórt sin a chur isteach chuig cléireach na Cúirte Dúiche ceithre lá roimh an dáta fillte ar a laghad

source: • An affidavit or statutory declaration of service of the claim notice
ga: Mura gcuireann tú in iúl go bhfuil tú chun na himeachtaí a chosaint, ní bheidh éisteacht ar bith agus gheobhaidh an creidiúnaí breithiúnais go bhfuil an t-airgead aige ort

source: • A certificate of no appearance/defence • An affidavit of debt verifying the creditor’s claim • A District Court decree
ga: Comhdaíonn an creidiúnaí Mionnscríbhinn Fiachais agus Forógra na Cúirte Dúiche le Cléireach na Cúirte Dúiche

source: There are different forms of affidavit depending on the kind of debt involved
ga: Tá cineálacha éagsúla mionnscríbhinne ag brath ar an gcineál fiachais atá i gceist

source: These documents constitute the District Court judgment set
ga: Is iad na cáipéisí seo sraith bhreithiúnais na Cúirte Dúiche

source: These are then checked and, if all documents are in order, the judge of the District Court issues the judgment
ga: Déantar iad seo a sheiceáil agus, más rud é go bhfuil na cáipéisí go léir in ord, eisíonn Breitheamh na Cúirte Dúiche an breithiúnas

source: The judgment is for the amount owed plus the costs involved in the proceedings
ga: Baineann an breithiúnas leis an méid atá ort chomh maith leis na costais a bhí ar na himeachtaí

source: Interest at the rate of 2% begins to run on the amount of the judgment (but not the costs) from the day the judgment is given
ga: Agus an breithiúnas bainte amach, tá an creidiúnaí i dteideal an breithiúnas a fhorghníomhú ansin

source: This interest rate was reduced from 8% by the Courts Act 1981 (Interest on Judgment Debts) Order 2016, which came into effect on 1 January 2017
ga: Tosaítear ag cur úis ar ráta de 8% le méid an bhreithiúnais (seachas na costais) ón lá a dtugtar an breithiúnas

source: If you defend the proceedings
ga: Má dhéanann tú agóid i gcoinne na n-imeachtaí

source: If you are defending the proceedings and have sent your form indicating your intention to defend, then the creditor serves a notice of trial on you at least 10 days before the court hearing
ga: Má tá tú chun agóid i gcoinne na n-imeachtaí agus tá tú tar éis d'fhoirm a chuireann in iúl go bhfuil sé ar intinn agat cosaint a sheoladh, éistfear an cás os comhair bhreitheamh na Cúirte Dúiche

source: At the hearing, the judge hears the arguments from the creditor and from you and makes a decision
ga: Éisteann an breitheamh leis na hargóintí ón gcreidiúnaí agus uait, agus a déanann sé a chinneadh

source: That could be to make a judgment in favour of the creditor or to dismiss the action
ga: D'fhéadfadh sé breithiúnas a thabhairt i bhfabhar an chreidiúnaí nó an chaingean a dhíbirt

source: If the judge considers that you cannot pay the amount through no fault of yours, the judge may grant a stay of execution for a period of time
ga: Má mheasann an breitheamh nach féidir leat an méid a íoc gan aon locht ortsa, féadann an breitheamh bac ar fhorghníomhú a dheonú ar feadh tréimhse ama

source: The judge may make an order for payment by instalments
ga: Féadann an breitheamh ordú a dhéanamh go ndéanfaidh tú íocaíochtaí trí thráthchodanna chomh maith

source: If you do not defend the proceedings, there is no hearing so it is highly unlikely that a stay of execution or payment by instalments will be granted
ga: Mura ndéanann tú agóid i gcoinne na n-imeachtaí, ní bheidh éisteacht ar bith agus mar sin, ní dócha go ndeonófar bac ar fhorghníomhú nó íocaíocht trí thráthchodanna

source: The procedure is broadly similar to that which applies in the District Court but there are some differences in the documents which are used
ga: Tá an nós imeachta seo an-chosúil le nósanna imeachta na Cúirte Dúiche, ach tá roinnt difríochtaí ann idir na cáipéisí a úsáidtear

source: The rules are set out in the Circuit Court rules
ga: Tá na rialacha leagtha amach i rialacha na Cúirte Cuarda

source: The proceedings start with the creditor serving an ordinary civil bill on you
ga: Cuirtear tús leis na himeachtaí nuair a dhéanann an creidiúnaí gnáthbhille sibhialta a sheirbheáil ort

source: This is broadly similar to the claim notice used in the District Court
ga: Tá sé seo cosúil leis an toghairm shibhialta a úsáidtear sa Chúirt Dúiche

source: The claim being made by the creditor is set out in the indorsement of claim
ga: Tá an t-éileamh atá á dhéanamh ag an gcreidiúnaí leagtha amach san Fhormhuiniú Éilimh

source: This must set out the details such as the date and the content of the contract
ga: Ní mór dó na sonraí a bhaineann leis an gcás a leagan amach, mar shampla, an dáta agus ábhar an chonartha

source: The civil bill states that, if you want to defend the case, you must enter an appearance within 10 days
ga: Deir an bille sibhialta nach mór duit láithreas a thaifeadadh os comhair cúirte laistigh de 10 lá más mian leat an cás a chosaint,

source: This period can be extended by agreement or by direction of the court
ga: Is féidir an tréimhse sin a shíneadh de bharr comhaontú nó ordú na cúirte

source: Entering an appearance means that you must lodge a specified form with the County Registrar and give a copy to the creditor or his solicitor
ga: Ciallaíonn “láithreas a thaifeadadh os comhair cúirte” go gcaithfidh tú foirm shonraithe a thabhairt do Chláraitheoir an Chontae agus cóip a thabhairt don chreidiúnaí nó dá aturnae chomh maith

source: The County Registrar organises the business of the Circuit Court and has a broadly similar role to that of the Clerk of the District Court
ga: Eagraíonn Cláraitheoir an Chontae gnó na Cúirte Cuarda agus tá ról aige atá cosúil le ról Chléireach na Cúirte Dúiche

source: If you do not propose to defend the action, you may consent to the claim in the same way as in the District Court
ga: Mura bhfuil tú chun agóid a dhéanamh i gcoinne na caingne, is féidir leat toiliú leis an éileamh ar an mbealach céanna atá sa Chúirt Dúiche

source: If you do not enter an appearance or if you enter an appearance and then do not deliver a defence, the creditor may apply to the court for a judgment in default of appearance
ga: Mura ndéanann tú láithreas a thaifeadadh os comhair cúirte nó má dhéanann tú láithreas a thaifeadadh os comhair cúirte ach ní sheachnaíonn tú cosaint ansin, is féidir leis an gcreidiúnaí iarraidh ar an gCúirt le haghaidh 'Breithiúnas Mainneachtana'

source: This judgment is given if the relevant documents are lodged by the creditor
ga: Tugtar an breithiúnas seo más rud é go bhfuil na cáipéisí ábhartha taiscthe ag an gcreidiúnaí

source: It seems that some County Registrars require that the creditor give you 14 days' warning notice of such an application but this is not a legal requirement
ga: Dealraíonn sé go dteastaíonn ó roinnt Cláraitheoirí Contae go dtabharfadh an creidiúnaí fógra rabhaidh de 14 lá duit i dtaobh iarratais den sórt seo ach ní ceanglas dlíthiúil é

source: The judgment is for the amount owed plus costs
ga: Baineann an breithiúnas leis an méid atá ort chomh maith leis na costais a bhí ar na himeachtaí

source: Once the judgment has been granted, the creditor may then apply for an execution order in order to enforce the judgment
ga: Tar éis don bhreithiúnas a thabhairt, féadfaidh an creidiúnaí iarratas a dhéanamh ar Ordú Forghníomhaithe ionas go mbeidh siad in ann an breithiúnas a fhorghníomhú

source: Proceedings in the High Court are started by means of a summary summons
ga: Cuirtear tús le himeachtaí san Ard-Chúirt trí Thoghairm Achomair

source: In general, this must be served in person unless that is not reasonably practical
ga: De ghnáth, ní mór é seo a sheirbheáil go pearsanta mura bhfuil sé sin praiticiúil go réasúnta

source: There are provisions for substituted service which are broadly similar to those in the District Court
ga: Tá forálacha ann le haghaidh seirbheáil ionadach atá cosúil leo siúd atá sa Chúirt Dúiche

source: The summary summons must include an indorsement of claim
ga: Caithfidh an toghairm achomair Formhuiniú Éilimh a chuimsiú

source: This sets out the amount which the creditor claims is owed plus costs
ga: Leagann sé seo amach an méid a éilíonn an creidiúnaí go bhfuil ort chomh maith le costais

source: It also states that, if you pay within 6 days, the proceedings will not go ahead (the proceedings are stayed)
ga: Deir sé, chomh maith, má íocann tú taobh istigh de sé lá, ní rachaidh na himeachtaí ar aghaidh (beidh na himeachtaí bactha)

source: If the creditor is a licensed moneylender, this fact must be stated in the indorsement of claim; other details about the loan agreement must also be stated, such as the applicable rate of interest
ga: Más iasachtaí airgid ceadúnaithe é an creidiúnaí, ní mór dó é sin a lua i bhFormhuiniú an Éilimh; ní mór dó sonraí eile mar gheall ar an gcomhaontú iasachta a lua chomh maith, mar shampla an ráta úis infheidhme

source: You have 3 options:
ga: Tá trí rogha agat:

source: • You may pay the amount owed plus costs within 6 days and the proceedings will not go ahead
ga: • Is féidir leat an méid atá ort a íoc chomh maith le costais laistigh de sé lá agus ní rachaidh na himeachtaí ar aghaidh;

source: • You consent to judgment and ask for further time for payment
ga: • Toilíonn tú leis an mbreithiúnas agus déanann tú iarratas ar thuilleadh ama chun íocaíochtaí a dhéanamh;

source: • You may defend the proceedings by entering an appearance
ga: • Is féidir leat na himeachtaí a chosaint trí 'láithreas a thaifeadadh os comhair cúirte'

source: You do this by delivering a memorandum in writing to the Central Office of the Four Courts, Dublin within 8 days of the service of the summons
ga: Chun é seo a dhéanamh, déanann tú meabhrán a sheachadadh i scríbhinn chuig Príomh-Oifig na Ceithre Cúirteanna, Baile Átha Cliath laistigh d'ocht lá ón lá ar ar seirbheáladh an toghairm

source: If you do not enter an appearance, the creditor may get judgment in default of appearance from the Central Office of the High Court
ga: Mura ndéanann tú láithreas a thaifeadadh os comhair cúirte, is féidir leis an gcreidiúnaí breithiúnas mainneachtana a fháil ó Phríomh-Oifig na Ceithre Cúirteanna

source: In some cases, for example, moneylending agreements, the permission of the Master of the High Court is required before such a judgment can be granted
ga: I gcásanna áirithe a bhaineann le comhaontuithe iasachtaithe airgid, bheadh cead Mháistir na hArd-Chúirte ag teastáil sula bhféadfaí breithiúnas mar sin a dheonú

source: If you do enter an appearance and defend the proceedings, then the case is heard by a High Court judge and judgment is given
ga: Má dhéanann tú láithreas a thaifeadadh os comhair cúirte agus déanann tú agóid i gcoinne na n-imeachtaí, éistfidh Breitheamh na hArd-Chúirte an cás agus tabharfaidh sé breithiúnas

source: Usually, the creditor looks for an order of fieri facias at the same time
ga: De ghnáth, lorgaíonn an creidiúnaí ordú fieri facias ag an am céanna

source: If the creditor gets a judgment against you, they are entitled to use various mechanisms to get the money from you
ga: Má tá breithiúnas bainte amach ag creidiúnaí i do choinne, tá sé i dteideal an breithiúnas a fhorghníomhú ansin

source: Read more in our document on enforcement of judgments
ga: Léigh a thuilleadh inár ndoiciméad ar Fhorfheidhmiú breithiúnas
